<!-- terraform-plan-comment -->
## Terraform Plan

<details>
<summary>Click to expand plan output</summary>

```hcl
google_compute_managed_ssl_certificate.app_cert: Refreshing state... [id=projects/fenrir-ledger-prod/global/sslCertificates/fenrir-app-cert]
google_project_service.apis["artifactregistry.googleapis.com"]: Refreshing state... [id=fenrir-ledger-prod/artifactregistry.googleapis.com]
data.google_project.project: Reading...
google_project_service.apis["firestore.googleapis.com"]: Refreshing state... [id=fenrir-ledger-prod/firestore.googleapis.com]
google_project_iam_member.deploy_firestore: Refreshing state... [id=fenrir-ledger-prod/roles/datastore.owner/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_service.apis["monitoring.googleapis.com"]: Refreshing state... [id=fenrir-ledger-prod/monitoring.googleapis.com]
google_project_service.apis["iam.googleapis.com"]: Refreshing state... [id=fenrir-ledger-prod/iam.googleapis.com]
google_project_service.apis["billingbudgets.googleapis.com"]: Refreshing state... [id=fenrir-ledger-prod/billingbudgets.googleapis.com]
google_project_service.apis["firebaserules.googleapis.com"]: Refreshing state... [id=fenrir-ledger-prod/firebaserules.googleapis.com]
google_project_service.apis["compute.googleapis.com"]: Refreshing state... [id=fenrir-ledger-prod/compute.googleapis.com]
google_project_service.apis["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=fenrir-ledger-prod/cloudresourcemanager.googleapis.com]
google_project_service.apis["container.googleapis.com"]: Refreshing state... [id=fenrir-ledger-prod/container.googleapis.com]
data.google_project.project: Read complete after 1s [id=projects/fenrir-ledger-prod]
google_project_service.apis["dns.googleapis.com"]: Refreshing state... [id=fenrir-ledger-prod/dns.googleapis.com]
google_project_service.apis["logging.googleapis.com"]: Refreshing state... [id=fenrir-ledger-prod/logging.googleapis.com]
google_service_account.app_workload: Refreshing state... [id=projects/fenrir-ledger-prod/serviceAccounts/fenrir-app-workload@fenrir-ledger-prod.iam.gserviceaccount.com]
google_service_account.agents_workload: Refreshing state... [id=projects/fenrir-ledger-prod/serviceAccounts/fenrir-agents-workload@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.deploy_roles["roles/dns.admin"]: Refreshing state... [id=fenrir-ledger-prod/roles/dns.admin/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.deploy_roles["roles/container.developer"]: Refreshing state... [id=fenrir-ledger-prod/roles/container.developer/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.deploy_roles["roles/iam.serviceAccountAdmin"]: Refreshing state... [id=fenrir-ledger-prod/roles/iam.serviceAccountAdmin/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.deploy_roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=fenrir-ledger-prod/roles/iam.serviceAccountUser/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.deploy_roles["roles/compute.networkAdmin"]: Refreshing state... [id=fenrir-ledger-prod/roles/compute.networkAdmin/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.deploy_roles["roles/artifactregistry.admin"]: Refreshing state... [id=fenrir-ledger-prod/roles/artifactregistry.admin/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.deploy_roles["roles/compute.loadBalancerAdmin"]: Refreshing state... [id=fenrir-ledger-prod/roles/compute.loadBalancerAdmin/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.deploy_roles["roles/compute.securityAdmin"]: Refreshing state... [id=fenrir-ledger-prod/roles/compute.securityAdmin/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.deploy_roles["roles/resourcemanager.projectIamAdmin"]: Refreshing state... [id=fenrir-ledger-prod/roles/resourcemanager.projectIamAdmin/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.deploy_roles["roles/logging.admin"]: Refreshing state... [id=fenrir-ledger-prod/roles/logging.admin/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.deploy_roles["roles/container.admin"]: Refreshing state... [id=fenrir-ledger-prod/roles/container.admin/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.deploy_roles["roles/certificatemanager.editor"]: Refreshing state... [id=fenrir-ledger-prod/roles/certificatemanager.editor/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.deploy_roles["roles/monitoring.admin"]: Refreshing state... [id=fenrir-ledger-prod/roles/monitoring.admin/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.agents_logging: Refreshing state... [id=fenrir-ledger-prod/roles/logging.logWriter/serviceAccount:fenrir-agents-workload@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.agents_monitoring: Refreshing state... [id=fenrir-ledger-prod/roles/monitoring.metricWriter/serviceAccount:fenrir-agents-workload@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.agents_storage: Refreshing state... [id=fenrir-ledger-prod/roles/storage.objectAdmin/serviceAccount:fenrir-agents-workload@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.app_firestore: Refreshing state... [id=fenrir-ledger-prod/roles/datastore.user/serviceAccount:fenrir-app-workload@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.app_logging: Refreshing state... [id=fenrir-ledger-prod/roles/logging.logWriter/serviceAccount:fenrir-app-workload@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.app_monitoring: Refreshing state... [id=fenrir-ledger-prod/roles/monitoring.metricWriter/serviceAccount:fenrir-app-workload@fenrir-ledger-prod.iam.gserviceaccount.com]
google_project_iam_member.app_storage_reader: Refreshing state... [id=fenrir-ledger-prod/roles/storage.objectViewer/serviceAccount:fenrir-app-workload@fenrir-ledger-prod.iam.gserviceaccount.com]
google_compute_global_address.umami_ip: Refreshing state... [id=projects/fenrir-ledger-prod/global/addresses/umami-ip]
google_dns_managed_zone.app: Refreshing state... [id=projects/fenrir-ledger-prod/managedZones/fenrirledger-com]
google_firestore_database.default: Refreshing state... [id=projects/fenrir-ledger-prod/databases/(default)]
google_artifact_registry_repository.images: Refreshing state... [id=projects/fenrir-ledger-prod/locations/us-central1/repositories/fenrir-images]
google_compute_network.vpc: Refreshing state... [id=projects/fenrir-ledger-prod/global/networks/fenrir-vpc]
google_monitoring_uptime_check_config.app_health: Refreshing state... [id=projects/fenrir-ledger-prod/uptimeCheckConfigs/fenrir-app-health-check-KSS8KO1ZjAQ]
google_compute_global_address.monitor_ip: Refreshing state... [id=projects/fenrir-ledger-prod/global/addresses/monitor-ip]
google_compute_global_address.app_ip: Refreshing state... [id=projects/fenrir-ledger-prod/global/addresses/fenrir-app-ip]
google_monitoring_notification_channel.email: Refreshing state... [id=projects/fenrir-ledger-prod/notificationChannels/18175132539659565094]
google_dns_record_set.analytics: Refreshing state... [id=projects/fenrir-ledger-prod/managedZones/fenrirledger-com/rrsets/analytics.fenrirledger.com./A]
google_dns_record_set.monitor: Refreshing state... [id=projects/fenrir-ledger-prod/managedZones/fenrirledger-com/rrsets/monitor.fenrirledger.com./A]
google_monitoring_alert_policy.container_restarts: Refreshing state... [id=projects/fenrir-ledger-prod/alertPolicies/17528829657638754257]
google_monitoring_alert_policy.uptime_failure: Refreshing state... [id=projects/fenrir-ledger-prod/alertPolicies/2962841758214709531]
google_dns_record_set.apex: Refreshing state... [id=projects/fenrir-ledger-prod/managedZones/fenrirledger-com/rrsets/fenrirledger.com./A]
google_dns_record_set.www: Refreshing state... [id=projects/fenrir-ledger-prod/managedZones/fenrirledger-com/rrsets/www.fenrirledger.com./A]
google_compute_subnetwork.subnet: Refreshing state... [id=projects/fenrir-ledger-prod/regions/us-central1/subnetworks/fenrir-subnet]
google_compute_router.router: Refreshing state... [id=projects/fenrir-ledger-prod/regions/us-central1/routers/fenrir-router]
google_compute_firewall.allow_health_checks: Refreshing state... [id=projects/fenrir-ledger-prod/global/firewalls/fenrir-allow-health-checks]
google_artifact_registry_repository_iam_member.gke_reader: Refreshing state... [id=projects/fenrir-ledger-prod/locations/us-central1/repositories/fenrir-images/roles/artifactregistry.reader/serviceAccount:fenrir-app-workload@fenrir-ledger-prod.iam.gserviceaccount.com]
google_artifact_registry_repository_iam_member.deploy_writer: Refreshing state... [id=projects/fenrir-ledger-prod/locations/us-central1/repositories/fenrir-images/roles/artifactregistry.writer/serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com]
google_artifact_registry_repository_iam_member.agents_reader: Refreshing state... [id=projects/fenrir-ledger-prod/locations/us-central1/repositories/fenrir-images/roles/artifactregistry.reader/serviceAccount:fenrir-agents-workload@fenrir-ledger-prod.iam.gserviceaccount.com]
google_container_cluster.autopilot: Refreshing state... [id=projects/fenrir-ledger-prod/locations/us-central1/clusters/fenrir-autopilot]
google_compute_router_nat.nat: Refreshing state... [id=fenrir-ledger-prod/us-central1/fenrir-router/fenrir-nat]
google_service_account_iam_member.app_workload_identity: Refreshing state... [id=projects/fenrir-ledger-prod/serviceAccounts/fenrir-app-workload@fenrir-ledger-prod.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/serviceAccount:fenrir-ledger-prod.svc.id.goog[fenrir-app/fenrir-app-sa]]
google_service_account_iam_member.agents_workload_identity: Refreshing state... [id=projects/fenrir-ledger-prod/serviceAccounts/fenrir-agents-workload@fenrir-ledger-prod.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/serviceAccount:fenrir-ledger-prod.svc.id.goog[fenrir-agents/fenrir-agents-sa]]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_firebaserules_release.firestore will be created
  + resource "google_firebaserules_release" "firestore" {
      + create_time  = (known after apply)
      + disabled     = (known after apply)
      + id           = (known after apply)
      + name         = "cloud.firestore"
      + project      = "fenrir-ledger-prod"
      + ruleset_name = (known after apply)
      + update_time  = (known after apply)
    }

  # google_firebaserules_ruleset.firestore will be created
  + resource "google_firebaserules_ruleset" "firestore" {
      + create_time = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + name        = (known after apply)
      + project     = "fenrir-ledger-prod"

      + source {
          + files {
              + content = <<-EOT
                    // ─── Fenrir Ledger — Firestore Security Rules ─────────────────────────────────
                    //
                    // These rules enforce household isolation at the database layer.
                    //
                    // Key invariants:
                    //   1. A user can only read/write their own /users/{uid} document.
                    //   2. A user can only read/write households where they are in memberIds[].
                    //   3. memberIds is capped at 3 entries.
                    //   4. Card CRUD requires the caller to be a member of the parent household.
                    //   5. All authenticated operations require a valid Clerk JWT (via Firebase Auth
                    //      or a custom token exchange — see note below).
                    //
                    // Note on authentication:
                    //   This app uses Clerk for auth, not Firebase Auth directly. When Firestore
                    //   security rules are enforced from the server (Admin SDK), these rules are
                    //   bypassed — the Admin SDK has root access. These rules apply to any future
                    //   direct client-SDK access or Firebase Emulator test suites.
                    //
                    //   For production, all Firestore access flows through API routes using the
                    //   Admin SDK. These rules serve as documentation + emulator test enforcement.
                    
                    rules_version = '2';
                    
                    service cloud.firestore {
                      match /databases/{database}/documents {
                    
                        // ─── Helper functions ──────────────────────────────────────────────────────
                    
                        // Returns the authenticated user's Clerk user ID from the JWT subject claim.
                        function userId() {
                          return request.auth.uid;
                        }
                    
                        // Returns true if the request is from an authenticated user.
                        function isAuthenticated() {
                          return request.auth != null;
                        }
                    
                        // Returns true if the caller's UID matches the given clerkUserId.
                        function isSelf(clerkUserId) {
                          return isAuthenticated() && userId() == clerkUserId;
                        }
                    
                        // Returns true if the caller is a member of the given household.
                        // Reads the household document to check memberIds.
                        function isHouseholdMember(householdId) {
                          return isAuthenticated() &&
                            userId() in get(/databases/$(database)/documents/households/$(householdId)).data.memberIds;
                        }
                    
                        // Returns true if the caller is the owner of the given household.
                        function isHouseholdOwner(householdId) {
                          return isAuthenticated() &&
                            get(/databases/$(database)/documents/households/$(householdId)).data.ownerId == userId();
                        }
                    
                        // Validates a household document write: memberIds max 3, required fields.
                        function isValidHouseholdWrite(data) {
                          return data.keys().hasAll(['id', 'name', 'ownerId', 'memberIds', 'inviteCode',
                                                      'inviteCodeExpiresAt', 'tier', 'createdAt', 'updatedAt'])
                              && data.memberIds.size() >= 1
                              && data.memberIds.size() <= 3
                              && data.tier in ['free', 'karl']
                              && data.inviteCode.size() == 6;
                        }
                    
                        // Validates a user document write: required fields, role enum.
                        function isValidUserWrite(data) {
                          return data.keys().hasAll(['clerkUserId', 'email', 'displayName', 'householdId',
                                                      'role', 'createdAt', 'updatedAt'])
                              && data.role in ['owner', 'member'];
                        }
                    
                        // Validates a card document write: required fields.
                        function isValidCardWrite(data) {
                          return data.keys().hasAll(['id', 'householdId', 'issuerId', 'cardName',
                                                      'openDate', 'status', 'createdAt', 'updatedAt']);
                        }
                    
                        // ─── /users/{clerkUserId} ──────────────────────────────────────────────────
                    
                        match /users/{clerkUserId} {
                          // A user can only read their own document.
                          allow read: if isSelf(clerkUserId);
                    
                          // A user can only create their own document, and it must be valid.
                          // householdId must not be blank.
                          allow create: if isSelf(clerkUserId)
                              && isValidUserWrite(request.resource.data)
                              && request.resource.data.clerkUserId == clerkUserId
                              && request.resource.data.householdId.size() > 0;
                    
                          // A user can update their own document, but cannot change householdId or role
                          // (those require an invite flow — future issue).
                          allow update: if isSelf(clerkUserId)
                              && isValidUserWrite(request.resource.data)
                              && request.resource.data.clerkUserId == clerkUserId
                              && request.resource.data.householdId == resource.data.householdId
                              && request.resource.data.role == resource.data.role;
                    
                          // Users cannot delete their own document (requires admin action).
                          allow delete: if false;
                        }
                    
                        // ─── /households/{householdId} ─────────────────────────────────────────────
                    
                        match /households/{householdId} {
                          // Any member can read the household document.
                          allow read: if isHouseholdMember(householdId);
                    
                          // Only the owner can create a household (initial creation).
                          // They must include themselves in memberIds.
                          allow create: if isAuthenticated()
                              && isValidHouseholdWrite(request.resource.data)
                              && request.resource.data.id == householdId
                              && request.resource.data.ownerId == userId()
                              && userId() in request.resource.data.memberIds;
                    
                          // Only the owner can update the household.
                          // ownerId cannot be transferred via update (requires a separate transfer flow).
                          allow update: if isHouseholdOwner(householdId)
                              && isValidHouseholdWrite(request.resource.data)
                              && request.resource.data.id == householdId
                              && request.resource.data.ownerId == resource.data.ownerId
                              && request.resource.data.createdAt == resource.data.createdAt;
                    
                          // Only the owner can delete a household.
                          allow delete: if isHouseholdOwner(householdId);
                    
                          // ─── /households/{householdId}/cards/{cardId} ──────────────────────────
                    
                          match /cards/{cardId} {
                            // Any household member can read cards.
                            allow read: if isHouseholdMember(householdId);
                    
                            // Any household member can create a card in this household.
                            // cardId in the URL must match the id field in the document.
                            allow create: if isHouseholdMember(householdId)
                                && isValidCardWrite(request.resource.data)
                                && request.resource.data.id == cardId
                                && request.resource.data.householdId == householdId;
                    
                            // Any household member can update a card.
                            // householdId and id are immutable once created.
                            allow update: if isHouseholdMember(householdId)
                                && isValidCardWrite(request.resource.data)
                                && request.resource.data.id == resource.data.id
                                && request.resource.data.householdId == resource.data.householdId;
                    
                            // Any household member can soft-delete (set deletedAt).
                            // Hard deletes are blocked — use soft-delete pattern only.
                            allow delete: if false;
                          }
                        }
                    
                        // ─── Deny all other paths ──────────────────────────────────────────────────
                    
                        match /{document=**} {
                          allow read, write: if false;
                        }
                      }
                    }
                EOT
              + name    = "firestore.rules"
            }
        }
    }

  # google_project_iam_member.deploy_roles["roles/firebaserules.admin"] will be created
  + resource "google_project_iam_member" "deploy_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:fenrir-deploy@fenrir-ledger-prod.iam.gserviceaccount.com"
      + project = "fenrir-ledger-prod"
      + role    = "roles/firebaserules.admin"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

**Commit:** `fd6e765`